package backend.academy.domain;


import java.util.HashMap;

public class State {
    private HashMap<String, String> states = new HashMap<String, String>() {{
        put("Калифорния", "Штат на западном побережье США, известный своим технологическим сектором");
        put("Техас", "Второй по величине штат США, известный нефтяной промышленностью");
        put("Флорида", "Штат на юго-востоке США, известный своим климатом и пляжами");
        put("Нью-Йорк", "Штат на северо-востоке США, в котором расположен одноименный мегаполис");
        put("Иллинойс", "Штат на Среднем Западе США, где находится Чикаго");
        put("Пенсильвания", "Штат на северо-востоке США, известный историческими событиями");
        put("Огайо", "Штат на Среднем Западе США, известный промышленностью");
        put("Джорджия", "Штат на юго-востоке США, известный своей столицей Атлантой");
        put("Мичиган", "Штат на Среднем Западе США, известный автомобильной промышленностью");
        put("Северная Каролина", "Штат на юго-востоке США, известный своими университетами");
        put("Нью-Джерси", "Штат на восточном побережье США, рядом с Нью-Йорком");
        put("Вирджиния", "Штат на востоке США, с богатой историей и культурой");
        put("Вашингтон", "Штат на северо-западе США, где находится Сиэтл");
        put("Массачусетс", "Штат на северо-востоке США, известный университетами");
        put("Аризона", "Штат на юго-западе США, известный Гранд-К");

    }};
}
